georgewzy/KS_old_gateway/src/gateway/SZJS_gateway-elec/stm32flash/ISP_main.c
/*
  stm32flash - Open Source ST STM32 flash program for *nix
  Copyright 2010 Geoffrey McRae <geoff@spacevs.com>
  Copyright 2011 Steve Markgraf <steve@steve-m.de>
  Copyright 2012-2016 Tormod Volden <debian.tormod@gmail.com>
  Copyright 2013-2016 Antonio Borneo <borneo.antonio@gmail.com>

  This program is free software; you can redistribute it and/or
  modify it under the terms of the GNU General Public License
  as published by the Free Software Foundation; either version 2
  of the License, or (at your option) any later version.

  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with this program; if not, write to the Free Software
  Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
*/

/*

Song: noted. 2016-6-13 13:53:58

READ ME:
    This is a transplant for RTT. For now, just support .bin format files. you can active the 'ACT_WRITE' 
    'ACT_READ_PROTECT' and 'ACT_READ_UNPROTECT' action whit the function 
    ISP_stm32(struct port_options *port_opt, t_ISP_opt *opt). You can write
    to stm32 flash by function ISP_flash(filename, verify),enable the read protect
    by function ISP_readprot(void), disable the read protect by function
    ISP_unreadprot(void). 
    
    Demo using:
    
    ISP_unreadprot();
    ISP_flash("/boot/rtthread.bin", 1);
    ISP_readprot();

*/

//#include <sys/types.h>
//#include <sys/stat.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
//#include <unistd.h>
#include <string.h>
//#include "getopt.h"

#include "init.h"
#include "utils.h"
#include "ISP_serial.h"
#include "stm32.h"
#include "parsers/parser.h"
#include "port.h"

#include "parsers/binary.h"
#include "parsers/hex.h"

#include "dfs_def.h"
#include <dfs_posix.h>


#define VERSION "0.5"


// Song: added at 2016-6-8 16:15:29.
extern char *optarg;
extern int optind, opterr, optopt;
int getopt(int argc, char * const argv[], const  char  *optstring);

/* device globals */
stm32_t		*stm		= NULL;

void		*p_st		= NULL;
parser_t	*parser		= NULL;

/* settings */
struct port_options port_opts = {
	.device = "uart2",
    .baudRate = SERIAL_BAUD_115200,
    .serial_mode = "8e1",
    .bus_addr = 0,
    .rx_frame_max = STM32_MAX_RX_FRAME,
    .tx_frame_max = STM32_MAX_TX_FRAME,
};

enum actions {
	ACT_NONE,
	ACT_READ,
	ACT_WRITE,
	ACT_WRITE_UNPROTECT,
	ACT_READ_PROTECT,
	ACT_READ_UNPROTECT,
	ACT_ERASE_ONLY,
	ACT_CRC
};

//enum actions	action		= ACT_NONE;
//int		npages		= 0;
//int             spage           = 0;
int             no_erase        = 0;
//char		verify		= 0;
//int		retry		= 10;
//char		exec_flag	= 0;
//uint32_t	execute		= 0;
//char		init_flag	= 1;
//char		force_binary	= 0;
//char		reset_flag	= 0;
//char		*filename;
//char		*gpio_seq	= NULL;
//uint32_t	start_addr	= 0;
//uint32_t	readwrite_len	= 0;

typedef struct
{
//struct port_options     port_opts;
enum actions    action;
int		        npages;
int             spage;
//int             no_erase;
char		    verify;
int		        retry;
char		    exec_flag;
uint32_t	    execute;
char		    init_flag;
char		    force_binary;
char		    reset_flag;
char		    filename[64];
char		    gpio_seq[48];
uint32_t	    start_addr;
uint32_t	    readwrite_len;
} t_ISP_opt;


t_ISP_opt ISP_opt = {
.action		= ACT_WRITE,
.npages		= 0,
.spage           = 0,
//.no_erase        = 0,
.verify		= 0,
.retry		= 10,
.exec_flag	= 0,
.execute		= 0,
.init_flag	= 1,
.force_binary	= 1,
.reset_flag	= 1,
.filename = {0},
.gpio_seq	= "boot,-reset,reset:-boot,-reset,reset",
.start_addr	= 0,
.readwrite_len	= 0
};

/* functions */
int  parse_options(int argc, char *argv[]);
void show_help(char *name);

static const char *action2str(enum actions act)
{
	switch (act) {
		case ACT_READ:
			return "memory read";
		case ACT_WRITE:
			return "memory write";
		case ACT_WRITE_UNPROTECT:
			return "write unprotect";
		case ACT_READ_PROTECT:
			return "read protect";
		case ACT_READ_UNPROTECT:
			return "read unprotect";
		case ACT_ERASE_ONLY:
			return "flash erase";
		case ACT_CRC:
			return "memory crc";
		default:
			return "";
	};
}

static void err_multi_action(enum actions new)
{
	rt_kprintf(
		"ERROR: Invalid options !\n"
		"\tCan't execute \"%s\" and \"%s\" at the same time.\n",
		action2str(ISP_opt.action), action2str(new));
}

static int is_addr_in_ram(uint32_t addr)
{
	return addr >= stm->dev->ram_start && addr < stm->dev->ram_end;
}

static int is_addr_in_flash(uint32_t addr)
{
	return addr >= stm->dev->fl_start && addr < stm->dev->fl_end;
}

/* returns the page that contains address "addr" */
static int flash_addr_to_page_floor(uint32_t addr)
{
	int page;
	uint32_t *psize;

	if (!is_addr_in_flash(addr))
		return 0;

	page = 0;
	addr -= stm->dev->fl_start;
	psize = stm->dev->fl_ps;

	while (addr >= psize[0]) {
		addr -= psize[0];
		page++;
		if (psize[1])
			psize++;
	}

	return page;
}

/* returns the first page whose start addr is >= "addr" */
int flash_addr_to_page_ceil(uint32_t addr)
{
	int page;
	uint32_t *psize;

	if (!(addr >= stm->dev->fl_start && addr <= stm->dev->fl_end))
		return 0;

	page = 0;
	addr -= stm->dev->fl_start;
	psize = stm->dev->fl_ps;

	while (addr >= psize[0]) {
		addr -= psize[0];
		page++;
		if (psize[1])
			psize++;
	}

	return addr ? page + 1 : page;
}

/* returns the lower address of flash page "page" */
static uint32_t flash_page_to_addr(int page)
{
	int i;
	uint32_t addr, *psize;

	addr = stm->dev->fl_start;
	psize = stm->dev->fl_ps;

	for (i = 0; i < page; i++) {
		addr += psize[0];
		if (psize[1])
			psize++;
	}

	return addr;
}




int ISP_stm32(struct port_options *port_opt, t_ISP_opt *opt)
{

	struct port_interface *port = NULL;
	int ret = 1;
	stm32_err_t s_err;
	parser_err_t perr;
	FILE *diag = stdout;
	uint8_t		buffer[256];
	uint32_t	addr, start, end;
	unsigned int	len;
	int		failed = 0;
	int		first_page, num_pages;

    off_t 	offset = 0;
    size_t r;
    unsigned int size;
    unsigned int max_wlen, max_rlen;
    
    //opt->action = ACT_WRITE;
    
    
    
	rt_kprintf( "stm32flash " VERSION "\n\n");
//	rt_kprintf( "http://stm32flash.sourceforge.net/\n\n");
//	if (parse_options(argc, argv) != 0)
//		goto close;

//	if ((action == ACT_READ) && filename[0] == '-') {
//		diag = stderr;
//	}

	if (opt->action == ACT_WRITE) {
		/* first try hex */
		if (!opt->force_binary) {
			parser = &PARSER_HEX;
			p_st = parser->init();
			if (!p_st) {
				rt_kprintf( "%s Parser failed to initialize\n", parser->name);
				goto close;
			}
		}

		if (opt->force_binary || (perr = parser->open(p_st, opt->filename, 0)) != PARSER_ERR_OK) {
			if (opt->force_binary || perr == PARSER_ERR_INVALID_FILE) {
				if (!opt->force_binary) {
					parser->close(p_st);
					p_st = NULL;
				}

				/* now try binary */
				parser = &PARSER_BINARY;
				p_st = parser->init();
				if (!p_st) {
					rt_kprintf( "%s Parser failed to initialize\n", parser->name);
					goto close;
				}
				perr = parser->open(p_st, opt->filename, 0);
			}

			/* if still have an error, fail */
			if (perr != PARSER_ERR_OK) {
				rt_kprintf( "%s ERROR: %s\n", parser->name, parser_errstr(perr));
				if (perr == PARSER_ERR_SYSTEM) perror(opt->filename);
				goto close;
			}
		}

		rt_kprintf( "Using Parser : %s\n", parser->name);
	} else {
		parser = &PARSER_BINARY;
		p_st = parser->init();
		if (!p_st) {
			rt_kprintf( "%s Parser failed to initialize\n", parser->name);
			goto close;
		}
	}

