georgewzy/KS_old_gateway/src/gateway/SZJS_gateway-elec/stm32flash/ISP_main.c
	if (port_open(port_opt, &port) != PORT_ERR_OK) {
		rt_kprintf( "Failed to open port: %s\n", port_opt->device);
		goto close;
	}

	rt_kprintf( "Interface %s: %s\n", port->name, port->get_cfg_str(port));
	if (opt->init_flag && init_bl_entry(port, opt->gpio_seq) == 0)
		goto close;
	stm = stm32_init(port, opt->init_flag);
	if (!stm)
		goto close;

	rt_kprintf( "Version      : 0x%02x\n", stm->bl_version);
	if (port->flags & PORT_GVR_ETX) {
		rt_kprintf( "Option 1     : 0x%02x\n", stm->option1);
		rt_kprintf( "Option 2     : 0x%02x\n", stm->option2);
	}
	rt_kprintf( "Device ID    : 0x%04x (%s)\n", stm->pid, stm->dev->name);
	rt_kprintf( "- RAM        : %dKiB  (%db reserved by bootloader)\n", (stm->dev->ram_end - 0x20000000) / 1024, stm->dev->ram_start - 0x20000000);
	rt_kprintf( "- Flash      : %dKiB (size first sector: %dx%d)\n", (stm->dev->fl_end - stm->dev->fl_start ) / 1024, stm->dev->fl_pps, stm->dev->fl_ps[0]);
	rt_kprintf( "- Option RAM : %db\n", stm->dev->opt_end - stm->dev->opt_start + 1);
	rt_kprintf( "- System RAM : %dKiB\n", (stm->dev->mem_end - stm->dev->mem_start) / 1024);


	/*
	 * Cleanup addresses:
	 *
	 * Starting from options
	 *	start_addr, readwrite_len, spage, npages
	 * and using device memory size, compute
	 *	start, end, first_page, num_pages
	 */
	if (opt->start_addr || opt->readwrite_len) {
		start = opt->start_addr;

		if (is_addr_in_flash(start))
			end = stm->dev->fl_end;
		else {
			no_erase = 1;
			if (is_addr_in_ram(start))
				end = stm->dev->ram_end;
			else
				end = start + sizeof(uint32_t);
		}

		if (opt->readwrite_len && (end > start + opt->readwrite_len))
			end = start + opt->readwrite_len;

		first_page = flash_addr_to_page_floor(start);
		if (!first_page && end == stm->dev->fl_end)
			num_pages = STM32_MASS_ERASE;
		else
			num_pages = flash_addr_to_page_ceil(end) - first_page;
	} else if (!opt->spage && !opt->npages) {
		start = stm->dev->fl_start;
		end = stm->dev->fl_end;
		first_page = 0;
		num_pages = STM32_MASS_ERASE;
	} else {
		first_page = opt->spage;
		start = flash_page_to_addr(first_page);
		if (start > stm->dev->fl_end) {
			rt_kprintf( "Address range exceeds flash size.\n");
			goto close;
		}

		if (opt->npages) {
			num_pages = opt->npages;
			end = flash_page_to_addr(first_page + num_pages);
			if (end > stm->dev->fl_end)
				end = stm->dev->fl_end;
		} else {
			end = stm->dev->fl_end;
			num_pages = flash_addr_to_page_ceil(end) - first_page;
		}

		if (!first_page && end == stm->dev->fl_end)
			num_pages = STM32_MASS_ERASE;
	}

	if (opt->action == ACT_READ) {
		unsigned int max_len = port_opt->rx_frame_max;

		rt_kprintf( "Memory read\n");

		perr = parser->open(p_st, opt->filename, 1);
		if (perr != PARSER_ERR_OK) {
			rt_kprintf( "%s ERROR: %s\n", parser->name, parser_errstr(perr));
			if (perr == PARSER_ERR_SYSTEM)
				perror(opt->filename);
			goto close;
		}

		//fflush(diag);
		addr = start;
		while(addr < end) {
			uint32_t left	= end - addr;
			len		= max_len > left ? left : max_len;
			s_err = stm32_read_memory(stm, addr, buffer, len);
			if (s_err != STM32_ERR_OK) {
				rt_kprintf( "Failed to read memory at address 0x%08x, target write-protected?\n", addr);
				goto close;
			}
			if (parser->write(p_st, buffer, len) != PARSER_ERR_OK)
			{
				rt_kprintf( "Failed to write data to file\n");
				goto close;
			}
			addr += len;

			rt_kprintf(
				"\rRead address 0x%08x (%.2f%%) ",
				addr,
				(100.0f / (float)(end - start)) * (float)(addr - start)
			);
			//fflush(diag);
		}
		rt_kprintf(	"Done.\n");
		ret = 0;
		goto close;
	} else if (opt->action == ACT_READ_PROTECT) {
		rt_kprintf( "Read-Protecting flash\n");
		/* the device automatically performs a reset after the sending the ACK */
		opt->reset_flag = 0;
		stm32_readprot_memory(stm);
		rt_kprintf(	"Done.\n");
	} else if (opt->action == ACT_READ_UNPROTECT) {
		rt_kprintf( "Read-UnProtecting flash\n");
		/* the device automatically performs a reset after the sending the ACK */
		opt->reset_flag = 0;
		stm32_runprot_memory(stm);
		rt_kprintf(	"Done.\n");
	} else if (opt->action == ACT_ERASE_ONLY) {
		ret = 0;
		rt_kprintf( "Erasing flash\n");

		if (num_pages != STM32_MASS_ERASE &&
		    (start != flash_page_to_addr(first_page)
		     || end != flash_page_to_addr(first_page + num_pages))) {
			rt_kprintf( "Specified start & length are invalid (must be page aligned)\n");
			ret = 1;
			goto close;
		}

		s_err = stm32_erase_memory(stm, first_page, num_pages);
		if (s_err != STM32_ERR_OK) {
			rt_kprintf( "Failed to erase memory\n");
			ret = 1;
			goto close;
		}
	} else if (opt->action == ACT_WRITE_UNPROTECT) {
		rt_kprintf( "Write-unprotecting flash\n");
		/* the device automatically performs a reset after the sending the ACK */
		opt->reset_flag = 0;
		stm32_wunprot_memory(stm);
		rt_kprintf(	"Done.\n");

	} else if (opt->action == ACT_WRITE) {
		rt_kprintf( "Write to memory\n");


		max_wlen = port_opt->tx_frame_max - 2;	/* skip len and crc */
		max_wlen &= ~3;	/* 32 bit aligned */

		max_rlen = port_opt->rx_frame_max;
		max_rlen = max_rlen < max_wlen ? max_rlen : max_wlen;

		/* Assume data from stdin is whole device */
		if (opt->filename[0] == '-' && opt->filename[1] == '\0')
			size = end - start;
		else
			size = parser->size(p_st);

		// TODO: It is possible to write to non-page boundaries, by reading out flash
		//       from partial pages and combining with the input data
		// if ((start % stm->dev->fl_ps[i]) != 0 || (end % stm->dev->fl_ps[i]) != 0) {
		//	rt_kprintf( "Specified start & length are invalid (must be page aligned)\n");
		//	goto close;
		// } 

		// TODO: If writes are not page aligned, we should probably read out existing flash
		//       contents first, so it can be preserved and combined with new data
		if (!no_erase && num_pages) {
			rt_kprintf( "Erasing memory\n");
			s_err = stm32_erase_memory(stm, first_page, num_pages);
			if (s_err != STM32_ERR_OK) {
				rt_kprintf( "Failed to erase memory\n");
				goto close;
			}
		}

		//fflush(diag);
		addr = start;
		while(addr < end && offset < size) {
			uint32_t left	= end - addr;
			len		= max_wlen > left ? left : max_wlen;
			len		= len > size - offset ? size - offset : len;

