georgewzy/KS_old_gateway/src/gateway/SZJS_gateway-elec/stm32flash/ISP_main.c
			if (parser->read(p_st, buffer, &len) != PARSER_ERR_OK)
				goto close;

			if (len == 0) {
				if (opt->filename[0] == '-') {
					break;
				} else {
					rt_kprintf( "Failed to read input file\n");
					goto close;
				}
			}
	
			again:
			s_err = stm32_write_memory(stm, addr, buffer, len);
			if (s_err != STM32_ERR_OK) {
				rt_kprintf( "Failed to write memory at address 0x%08x\n", addr);
				goto close;
			}

			if (opt->verify) {
				uint8_t compare[len];
				unsigned int offset, rlen;

				offset = 0;
				while (offset < len) {
					rlen = len - offset;
					rlen = rlen < max_rlen ? rlen : max_rlen;
					s_err = stm32_read_memory(stm, addr + offset, compare + offset, rlen);
					if (s_err != STM32_ERR_OK) {
						rt_kprintf( "Failed to read memory at address 0x%08x\n", addr + offset);
						goto close;
					}
					offset += rlen;
				}

				for(r = 0; r < len; ++r)
					if (buffer[r] != compare[r]) {
						if (failed == opt->retry) {
							rt_kprintf( "Failed to verify at address 0x%08x, expected 0x%02x and found 0x%02x\n",
								(uint32_t)(addr + r),
								buffer [r],
								compare[r]
							);
							goto close;
						}
						++failed;
						goto again;
					}

				failed = 0;
			}

			addr	+= len;
			offset	+= len;

			rt_kprintf(
				"\rWrote %saddress 0x%08x (%.2f%%) ",
				opt->verify ? "and verified " : "",
				addr,
				(100.0f / size) * offset
			);
			//fflush(diag);

		}

		rt_kprintf(	"Done.\n");
		ret = 0;
		goto close;
	} else if (opt->action == ACT_CRC) {
		uint32_t crc_val = 0;

		rt_kprintf( "CRC computation\n");

		s_err = stm32_crc_wrapper(stm, start, end - start, &crc_val);
		if (s_err != STM32_ERR_OK) {
			rt_kprintf( "Failed to read CRC\n");
			goto close;
		}
		rt_kprintf( "CRC(0x%08x-0x%08x) = 0x%08x\n", start, end,
			crc_val);
		ret = 0;
		goto close;
	} else
		ret = 0;

close:
	if (stm && opt->exec_flag && ret == 0) {
		if (opt->execute == 0)
			opt->execute = stm->dev->fl_start;

		rt_kprintf( "\nStarting execution at address 0x%08x... ", opt->execute);
		//fflush(diag);
		if (stm32_go(stm, opt->execute) == STM32_ERR_OK) {
			opt->reset_flag = 0;
			rt_kprintf( "done.\n");
		} else
			rt_kprintf( "failed.\n");
	}

	if (stm && opt->reset_flag) {
		rt_kprintf( "\nResetting device... ");
		//fflush(diag);
		if (init_bl_exit(stm, port, opt->gpio_seq))
			rt_kprintf( "done.\n");
		else	rt_kprintf( "failed.\n");
	}

	if (p_st  ) parser->close(p_st);
	if (stm   ) stm32_close  (stm);
	if (port)
		port->close(port);

	rt_kprintf( "\n");
	return ret;
}


#ifdef RT_USING_FINSH
#include <finsh.h>
int ISP_flash(char *filename, uint8_t verify)
{
    strcpy(ISP_opt.filename, filename);
    ISP_opt.action = ACT_WRITE;
    ISP_opt.verify = verify;
    ISP_opt.reset_flag = 1;
    
    ISP_stm32(&port_opts, &ISP_opt);
}
FINSH_FUNCTION_EXPORT_ALIAS(ISP_flash, ISP_flash, ISP flash for stm32 --filename  --verify.);

int ISP_readprot(void)
{
    ISP_opt.action = ACT_READ_PROTECT;
    ISP_opt.reset_flag = 1;
    ISP_stm32(&port_opts, &ISP_opt);
}
FINSH_FUNCTION_EXPORT_ALIAS(ISP_readprot, ISP_readprot, ISP enable the read protect.);

int ISP_unreadprot(void)
{
    ISP_opt.action = ACT_READ_UNPROTECT;
    ISP_opt.reset_flag = 1;
    ISP_stm32(&port_opts, &ISP_opt);
}
FINSH_FUNCTION_EXPORT_ALIAS(ISP_unreadprot, ISP_unreadprot, ISP disable the read protect.);
#endif 




//int parse_options(int argc, char *argv[])
//{
//	int c;
//	char *pLen;

//	while ((c = getopt(argc, argv, "a:b:m:r:w:e:vn:g:jkfcChuos:S:F:i:R")) != -1) {
//		switch(c) {
//			case 'a':
//				port_opts.bus_addr = strtoul(optarg, NULL, 0);
//				break;

//			case 'b':
//				port_opts.baudRate = serial_get_baud(strtoul(optarg, NULL, 0));
//				if (port_opts.baudRate == SERIAL_BAUD_INVALID) {
//					serial_baud_t baudrate;
//					rt_kprintf(	"Invalid baud rate, valid options are:\n");
//					for (baudrate = SERIAL_BAUD_1200; baudrate != SERIAL_BAUD_INVALID; ++baudrate)
//						rt_kprintf( " %d\n", serial_get_baud_int(baudrate));
//					return 1;
//				}
//				break;

//			case 'm':
//				if (strlen(optarg) != 3
//					|| serial_get_bits(optarg) == SERIAL_BITS_INVALID
//					|| serial_get_parity(optarg) == SERIAL_PARITY_INVALID
//					|| serial_get_stopbit(optarg) == SERIAL_STOPBIT_INVALID) {
//					rt_kprintf( "Invalid serial mode\n");
//					return 1;
//				}
//				port_opts.serial_mode = optarg;
//				break;

//			case 'r':
//			case 'w':
//				if (action != ACT_NONE) {
//					err_multi_action((c == 'r') ? ACT_READ : ACT_WRITE);
//					return 1;
//				}
//				action = (c == 'r') ? ACT_READ : ACT_WRITE;
//				filename = optarg;
//				if (filename[0] == '-') {
//					force_binary = 1;
//				}
//				break;
//			case 'e':
//				if (readwrite_len || start_addr) {
//					rt_kprintf( "ERROR: Invalid options, can't specify start page / num pages and start address/length\n");
//					return 1;
//				}
//				npages = strtoul(optarg, NULL, 0);
//				if (npages > 0xFF || npages < 0) {
//					rt_kprintf( "ERROR: You need to specify a page count between 0 and 255");
//					return 1;
//				}
//				if (!npages)
//					no_erase = 1;
//				break;
//			case 'u':
//				if (action != ACT_NONE) {
//					err_multi_action(ACT_WRITE_UNPROTECT);
//					return 1;
//				}
//				action = ACT_WRITE_UNPROTECT;
//				break;

//			case 'j':
//				if (action != ACT_NONE) {
//					err_multi_action(ACT_READ_PROTECT);
//					return 1;
//				}
//				action = ACT_READ_PROTECT;
//				break;

//			case 'k':
//				if (action != ACT_NONE) {
//					err_multi_action(ACT_READ_UNPROTECT);
//					return 1;
//				}
//				action = ACT_READ_UNPROTECT;
//				break;

//			case 'o':
//				if (action != ACT_NONE) {
//					err_multi_action(ACT_ERASE_ONLY);
//					return 1;
//				}
//				action = ACT_ERASE_ONLY;
//				break;

//			case 'v':
//				verify = 1;
//				break;

//			case 'n':
//				retry = strtoul(optarg, NULL, 0);
//				break;

//			case 'g':
//				exec_flag = 1;
//				execute   = strtoul(optarg, NULL, 0);
//				if (execute % 4 != 0) {
//					rt_kprintf( "ERROR: Execution address must be word-aligned\n");
//					return 1;
//				}
//				break;
//			case 's':
//				if (readwrite_len || start_addr) {
//					rt_kprintf( "ERROR: Invalid options, can't specify start page / num pages and start address/length\n");
//					return 1;
//				}
//				spage    = strtoul(optarg, NULL, 0);
//				break;
//			case 'S':
//				if (spage || npages) {
//					rt_kprintf( "ERROR: Invalid options, can't specify start page / num pages and start address/length\n");
//					return 1;
//				} else {
//					start_addr = strtoul(optarg, &pLen, 0);
//					if (*pLen == ':') {
//						pLen++;
//						readwrite_len = strtoul(pLen, NULL, 0);
//						if (readwrite_len == 0) {
//							rt_kprintf( "ERROR: Invalid options, can't specify zero length\n");
//							return 1;
//						}
//					}
//				}
//				break;
//			case 'F':
//				port_opts.rx_frame_max = strtoul(optarg, &pLen, 0);
//				if (*pLen == ':') {
//					pLen++;
//					port_opts.tx_frame_max = strtoul(pLen, NULL, 0);
//				}
//				if (port_opts.rx_frame_max < 0
//				    || port_opts.tx_frame_max < 0) {
//					rt_kprintf( "ERROR: Invalid negative value for option -F\n");
//					return 1;
//				}
//				if (port_opts.rx_frame_max == 0)
//					port_opts.rx_frame_max = STM32_MAX_RX_FRAME;
//				if (port_opts.tx_frame_max == 0)
//					port_opts.tx_frame_max = STM32_MAX_TX_FRAME;
//				if (port_opts.rx_frame_max < 20
//				    || port_opts.tx_frame_max < 6) {
//					rt_kprintf( "ERROR: current code cannot work with small frames.\n");
//					rt_kprintf( "min(RX) = 20, min(TX) = 6\n");
//					return 1;
//				}
//				if (port_opts.rx_frame_max > STM32_MAX_RX_FRAME) {
//					rt_kprintf( "WARNING: Ignore RX length in option -F\n");
//					port_opts.rx_frame_max = STM32_MAX_RX_FRAME;
//				}
//				if (port_opts.tx_frame_max > STM32_MAX_TX_FRAME) {
//					rt_kprintf( "WARNING: Ignore TX length in option -F\n");
//					port_opts.tx_frame_max = STM32_MAX_TX_FRAME;
//				}
//				break;
//			case 'f':
//				force_binary = 1;
//				break;

//			case 'c':
//				init_flag = 0;
//				break;

