georgewzy/KS_old_gateway/src/gateway/SZJS_gateway-elec/stm32flash/ISP_main.c
//			case 'h':
//				show_help(argv[0]);
//				//exit(0);
//                return 0;

//			case 'i':
//				gpio_seq = optarg;
//				break;

//			case 'R':
//				reset_flag = 1;
//				break;

//			case 'C':
//				if (action != ACT_NONE) {
//					err_multi_action(ACT_CRC);
//					return 1;
//				}
//				action = ACT_CRC;
//				break;
//		}
//	}

//	for (c = optind; c < argc; ++c) {
//		if (port_opts.device) {
//			rt_kprintf( "ERROR: Invalid parameter specified\n");
//			show_help(argv[0]);
//			return 1;
//		}
//		port_opts.device = argv[c];
//	}

//	if (port_opts.device == NULL) {
//		rt_kprintf( "ERROR: Device not specified\n");
//		show_help(argv[0]);
//		return 1;
//	}

//	if ((action != ACT_WRITE) && verify) {
//		rt_kprintf( "ERROR: Invalid usage, -v is only valid when writing\n");
//		show_help(argv[0]);
//		return 1;
//	}

//	return 0;
//}




void show_help(char *name) {
	rt_kprintf(
		"Usage: %s [-bvngfhc] [-[rw] filename] [tty_device | i2c_device]\n"
		"	-a bus_address	Bus address (e.g. for I2C port)\n"
		"	-b rate		Baud rate (default 57600)\n"
		"	-m mode		Serial port mode (default 8e1)\n"
		"	-r filename	Read flash to file (or - stdout)\n"
		"	-w filename	Write flash from file (or - stdout)\n"
		"	-C		Compute CRC of flash content\n"
		"	-u		Disable the flash write-protection\n"
		"	-j		Enable the flash read-protection\n"
		"	-k		Disable the flash read-protection\n"
		"	-o		Erase only\n"
		"	-e n		Only erase n pages before writing the flash\n"
		"	-v		Verify writes\n"
		"	-n count	Retry failed writes up to count times (default 10)\n"
		"	-g address	Start execution at specified address (0 = flash start)\n"
		"	-S address[:length]	Specify start address and optionally length for\n"
		"	                   	read/write/erase operations\n"
		"	-F RX_length[:TX_length]  Specify the max length of RX and TX frame\n"
		"	-s start_page	Flash at specified page (0 = flash start)\n"
		"	-f		Force binary parser\n"
		"	-h		Show this help\n"
		"	-c		Resume the connection (don't send initial INIT)\n"
		"			*Baud rate must be kept the same as the first init*\n"
		"			This is useful if the reset fails\n"
		"	-i GPIO_string	GPIO sequence to enter/exit bootloader mode\n"
		"			GPIO_string=[entry_seq][:[exit_seq]]\n"
		"			sequence=[-]n[,sequence]\n"
		"	-R		Reset device at exit.\n"
		"\n"
		"Examples:\n"
		"	Get device information:\n"
		"		%s /dev/ttyS0\n"
		"	  or:\n"
		"		%s /dev/i2c-0\n"
		"\n"
		"	Write with verify and then start execution:\n"
		"		%s -w filename -v -g 0x0 /dev/ttyS0\n"
		"\n"
		"	Read flash to file:\n"
		"		%s -r filename /dev/ttyS0\n"
		"\n"
		"	Read 100 bytes of flash from 0x1000 to stdout:\n"
		"		%s -r - -S 0x1000:100 /dev/ttyS0\n"
		"\n"
		"	Start execution:\n"
		"		%s -g 0x0 /dev/ttyS0\n"
		"\n"
		"	GPIO sequence:\n"
		"	- entry sequence: GPIO_3=low, GPIO_2=low, GPIO_2=high\n"
		"	- exit sequence: GPIO_3=high, GPIO_2=low, GPIO_2=high\n"
		"		%s -R -i -3,-2,2:3,-2,2 /dev/ttyS0\n",
		name,
		name,
		name,
		name,
		name,
		name,
		name,
		name
	);
}


